defmodule ParticaoTest do
  use ExUnit.Case
  doctest Particao

  test "partição" do
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10,11],2) == [[1,2,3,4,5,6], [7,8,9,10,11]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17],8) == [[1,2,3], [4,5], [6,7], [8,9], [10,11], [12,13], [14,15], [16,17]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18],8) == [[1,2,3], [4,5,6], [7,8], [9,10], [11,12], [13,14], [15,16], [17,18]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23],8) == [[1,2,3], [4,5,6], [7,8,9], [10,11,12], [13,14,15], [16,17,18], [19,20,21], [22,23]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10,11],3) == [[1,2,3,4],[5,6,7,8],[9,10,11]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9,10],2) == [[1,2,3,4,5],[6,7,8,9,10]]
    assert Particao.particionar([1,2,3,4,5,6,7,8,9],3) == [[1,2,3], [4,5,6], [7,8,9]]
    assert Particao.particionar([1,2,3],10) == [[1],[2],[3]]
  end
end
